runs/w3_laminarChannelFlow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          20000;
        startFace       37990;
    }

    south
    {
        type            patch;
        physicalType    patch;
        nFaces          2000;
        startFace       57990;
    }

    east
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       59990;
    }

    north
    {
        type            patch;
        physicalType    patch;
        nFaces          2000;
        startFace       60000;
    }

    west
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       62000;
    }

    front
    {
        type            empty;
        physicalType    patch;
        nFaces          20000;
        startFace       62010;
    }

)


// ************************************************************************* //
